//! # 빌더
//! 객체 생성. 복잡한 객체를 생성하는 방법과 표현하는 방법을 정의하는 클래스를 별도로 분리하여, 서로 다른 표현이더라도 이를 생성할 수 있는 동일한 절차를 제공할 수 있도록 한다.
//! 단계별 생성에 중점.
//!
//! ## 사용
//!
//! * 복합 객체의 생성 알고리즘이 이를 합성하는 요소 객체들이 무엇인지 이들의 조립 방법에 독립적일 때
//! * 합성할 객체들의 표현이 서로 다르더라도 생성 절차에서 이를 지원해야 할 때
//!
//! ## 구현
//!
//! 1. 매우 복잡한 클래스(product)가 있어야 됨.
//! 2. 사용자에게 이 클래스를 직접 완성하라고 하지 말고, 이 클래스를 구성하는 요소들을 나타내는 메서드를 가진 클래스(builder)를 만들어서 그걸 이용하라고 함.
//! 3. builder 인스턴스는 사용자에 의해 호출된 메서드들을 종합해서 product 인스턴스를 만들어냄.
//!
//! 아래 예제는 빌더 패턴 사용자 입장에서 어떤 식으로 쓰는 건지 보는 예제임.
//! reqwest는 http 클라이언트 라이브러리임. http 설정이 복잡한데, 빌더 패턴으로 원하는 설정만 붙여서 간단하게 만들 수 있음.

pub fn main() {
    let client = reqwest::Client::builder() // builder 인스턴스
        .http1_only()                // builder 인스턴스로 메서드 호출하는 모습
        .no_proxy()
        .no_gzip()
        .build().expect("생성 실패");           // 마지막으로 builder 인스턴스가 지금까지 호출된 메서드를 가지고, 최종 결과를 만들어냄.
}